---
kind: method
id: M:Autodesk.Revit.DB.ConnectorSet.ForwardIterator
source: html/bbd0fac6-0f3a-4e31-e53a-b28a769baee2.htm
---
# Autodesk.Revit.DB.ConnectorSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual ConnectorSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.